[
  {
    "company": "Google",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 24,
    "website": "https://buildyourfuture.withgoogle.com/programs/apm-program/",
    "comments": "",
    "description": "The Google Associate Product Manager (APM) program is a 2-year rotational program for recent university graduates interested in product management. Started in 2002 by future Yahoo CEO Marissa Mayer, it is the original new-grad PM program.",
    "prestige": 3
  },
  {
    "company": "Google",
    "role": "Associate Product Marketing Manager",
    "type": "Marketing",
    "technical": 0,
    "rotational": 1,
    "length_months": 30,
    "website": "https://www.google.com/about/careers/students/apmm.html",
    "comments": "",
    "description": "Whether it’s creating a global strategy for Search, or helping local African businesses make the most of the web, APMMs get to lead a wide variety of marketing projects throughout two distinct rotations. We accept 70-100 APMMs across 29 offices in 24 countries. APMMs complete a two-year program. The first rotation is assigned based on our business needs at the time and lasts approx. 18 months; the second is based on the associate’s interest in location, role, and product area. Many APMMs graduate from the program and stay in their second rotation, while others find another new role.",
    "prestige": 3
  },
  {
    "company": "Facebook",
    "role": "Associate Product Marketing Manager",
    "type": "Marketing",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://www.facebook.com/careers/students-and-grads/?teams[0]=University%20Grad%20-%20Engineering%2C%20Tech%20%26%20Design&teams[1]=University%20Grad%20-%20Business",
    "comments": "",
    "description": "You are a leader passionate about technology, innovation and defining how Facebook communicates about its products. Thriving in entrepreneurial environments, you learn by doing and juggling multiple projects and priorities at the same time. You understand Facebook and have a perspective on how to market it. Your passion for the consumer and / or developer audience fuel creative ideas for marketing campaigns. A good listener, you ask the right questions to hone in on what's most important. Innovation is something you bring to daily tasks and big endeavors.",
    "prestige": 2
  },
  {
    "company": "Facebook",
    "role": "Finance & Business Operations Analyst",
    "type": "Finance",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.facebook.com/careers/students-and-grads/?teams[0]=University%20Grad%20-%20Engineering%2C%20Tech%20%26%20Design&teams[1]=University%20Grad%20-%20Business",
    "comments": "",
    "description": "Facebook Finance & Business Operations Analyst's will have the unique opportunity to gain invaluable experience across a broad range of functions and have a large impact within a growing Finance organization. You will be deeply involved with a broad range of operational initiatives offering opportunities to interact with management; deliver business analytics and insights; make recommendations for short and long-term decisions; and drive significant contributions across areas including: the corporate planning processes, monitoring financial performance, reporting financial and operational results, and improving existing systems.",
    "prestige": 2
  },
  {
    "company": "Facebook",
    "role": "Rotational Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 1,
    "length_months": 18,
    "website": "http://fbrpms.com/",
    "comments": "",
    "description": "The Facebook RPM program is a community of builders who are given the unique opportunity to create products that help billions of people share and connect with each other. Our mission is to develop future product leaders by empowering, mentoring, and enabling them to build and learn across a variety of products across Facebook.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Account Executive",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "As an Account executive (AE), you are the main connection point between Microsoft and our customers., You provide strategic business leadership partnering with leaders in your customers' organizations to align their business transformation agenda with digital solutions that can help them better engage customers, optimize operations, transform products and shift their business models. Account Executive roles are an incredible opportunity to learn, experience and ultimately drive all aspects of the client relationship, sales pursuit, and customer success lifecycles.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Account Technology Strategist",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "Account Technology Strategists (ATSs) are our enterprise customer's chief architects. Acting as a chief architect offers a high profile, customer-facing role that is the primary technical face and orchestration point for enterprise customers. Successful ATS' have a strong, proven IT background and demonstrated knowledge with a broad range of Microsoft solutions and technologies.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "ACE Rotation Program",
    "type": "Marketing",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=ACE%20Rotation%20Program",
    "comments": "",
    "description": "The ACE Rotation Program is a two-year Redmond-based rotation program in which you will experience two unique marketing roles. The program helps new hires build strong foundations for their marketing careers through multiple, facilitated experiences and learning opportunities. As noted, this opportunity is for full-time hires and the rotations will be within various marketing teams and could be in one of the roles listed above.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Cloud Specialist",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "The Cloud Specialist at Microsoft leads our customers into the digital age.  Embracing a challenger mindset, the successful Cloud Specialist drives, orchestrates and closes opportunities with customers that produce transformative business outcomes.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Customer Success Manager",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "Customer Success Mangers (CSMs) focus on enabling our clients' vision for driving digital transformation within Microsoft solution areas. CSMs are our customer's success advocate as they deploy, use, adopt and consume our technology.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "MAIDAP Program Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 24,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=maidap",
    "comments": "",
    "description": "A new technology paradigm is emerging, one with an intelligent cloud and an intelligent edge. To foster Microsoft’s leadership in this field, Microsoft has launched a ground-breaking program to develop the next generation of leaders in AI. Located at the Microsoft New England Research and Development Center (NERD), the Microsoft AI Development Acceleration Program (MAIDAP) is hiring soon-to-be and recent graduates from BS, MS, and PhD programs. Over the course of two years, participants will work in interdisciplinary project teams to provide AI as a service to engineering teams across Microsoft and solve some of our most exciting and challenging AI problems. In addition, you will have mentors, exposure to leaders, and access to numerous AI data scientists, researchers and engineers across the company. After the program is completed, each participant will have the opportunity to work with one of the sponsoring Microsoft teams in Cambridge, MA or other Microsoft locations.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Partner Development Manager",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "The Partner Development Manager (PDM) is the critical business development role within Microsoft’s One Commercial Partner organization, acting as the daily face of our company to our partner channel. The PDM is accountable for driving performance of a managed portfolio of partners, by business priority, with a primary focus on Microsoft cloud services (O365, Azure and Dynamics 365) and complementary products. The goal is to drive partner recruitment, enablement and business growth based on the partners’ strengths and priorities. The role is responsible for the overall partner relationship, strategic business planning and landing execution across all key priorities. You will use your expertise in marketing, sales and technology right away to coordinate the right resources at the right time to drive mutual success for our partner channel and for Microsoft.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Product Marketing Manager",
    "type": "Marketing",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Marketing",
    "comments": "Filter by Profession: Marketing, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "You are the key to global marketing. You determine marketing strategy for your area and communicate through marketing plans, product content, and internal and external evangelism. The Product Marketing Manager understands, orchestrates, and influences campaigns and marketing activities, develops integrated marketing campaigns, and delivers product, solutions and customer campaign feedback to the business. An essential aspect of the role of the Product Marketing Manager is to align the content, timing and delivery of marketing messages and outreach to Microsoft’s customers and partners.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Program Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/professionals/us/en/search-results?subCategory=Program%20Management",
    "comments": "",
    "description": "Microsoft's Program Managers are similar to Product Managers at other companies.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Sales Operation Program Manager",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "CSMs are core to our long-term strategic success and by driving usage of cloud services and increasing accounts while broadening the surface area of potential with our accounts.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Solution Sales Professional",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "As a Solutions Sales Professional (SSP), you will identify our customers’ pain points and solve them through the latest software and services solutions. You will be our customers’ trusted consultant, thoroughly evaluating the health of their IT platforms and development environments and diagnosing areas for improvement. Your solutions drive measurable value, helping customers run their businesses more cost-effectively and efficiently and giving them a competitive edge in their marketplace—be it business, government, or academics.",
    "prestige": 2
  },
  {
    "company": "Microsoft",
    "role": "Technology Solution Professional",
    "type": "Sales",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.microsoft.com/students/us/en/search-results?keywords=Full%20Time%20Opportunities%20for%20Students%20or%20Recent%20Graduates%3A%20Sales",
    "comments": "Filter by Profession: Sales, Country: United States, Employment Type: Full Time, Level of Education: Bachelors",
    "description": "Technology Solution Professional (TSPs) drive the technical motions within sales driving specific solution area revenue and market share. Based on the tremendous opportunity of digital transformation across every individual and organization, we focus our broad portfolio of assets and go-to-market efforts across four key solution areas: Modern Workplace, Business Applications, Apps & Infrastructure, and Data & AI.",
    "prestige": 2
  },
  {
    "company": "Asana",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": "",
    "website": "https://asana.com/jobs/product?",
    "comments": "No dedicated APM page, but we'll point you at the main Product page",
    "description": "Put your creative ideas into action at a product-driven and design-led organization. Our Product organization includes a collaborative mix of teams across Product Management, Product Design, Brand Design, and User Experience Research.",
    "prestige": 1
  },
  {
    "company": "Box",
    "role": "Associate Technical Consultant",
    "type": "Consulting",
    "technical": 1,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.box.com/search-results?keywords=Associate%20Technical%20Consultant",
    "comments": "The page says \"2+ years experience needed,\" but we have friends who got the job straight out of college",
    "description": "You are a technologist at heart. You appreciate the power of technology and how it can be leveraged to solve complex problems. Being a trusted advisor and a change agent is energizing. You get excited about collaborating across all of Box to drive successful outcomes. You understand that you can never stop learning and mentoring, keeping your technical skills sharp requires perpetual development.",
    "prestige": 1
  },
  {
    "company": "Dropbox",
    "role": "Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.dropbox.com/jobs/teams/product",
    "comments": "Look for \"Product Manager University Grad\" on page",
    "description": "Our Product team advocates for our users and our business, setting the vision for our growing family of products. We use data, research, strategy, and empathy to guide multidisciplinary teams toward a common goal, balancing diverse perspectives and empowering our teams to do great work. As we scale globally, there’s plenty of space for you to grow alongside us and simplify life for millions of people around the world in team that always focuses on we, not I, and creates delightful products that are worthy of trust.",
    "prestige": 1
  },
  {
    "company": "Intuit",
    "role": "Rotational Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 1,
    "length_months": 18,
    "website": "https://careers.intuit.com/students",
    "comments": "The actual site -- intuitrpms.com -- 404s, but we're linking the generic students page",
    "description": "Launch your career by making a meaningful impact, powering prosperity for 50 million people around the world.",
    "prestige": 1
  },
  {
    "company": "KPCB",
    "role": "Product Fellow",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 12,
    "website": "http://fellows.kleinerperkins.com/#apply",
    "comments": "",
    "description": "Applications should open every January 1 for KPCB’s Product Fellows Program, which involves a one-year fellowship as a product manager at one of KPCB’s portfolio companies. Previous Product Fellows have worked at companies including Uber, Square, Zynga, DocuSign, One Kings Lane, Kinsa, AppDynamics, and Drawbridge. In the past, KPCB has shared advice on how to apply successfully.",
    "prestige": 1
  },
  {
    "company": "LinkedIn",
    "role": "Business Leadership Program",
    "type": "Strategy",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://careers.linkedin.com/students/business-leadership-program/SalesatLinkedIn",
    "comments": "",
    "description": "You will learn new sales skills, be certified by seasoned sales professionals, and develop meaningful relationships. You join the Sales Academy for four semesters of training.",
    "prestige": 1
  },
  {
    "company": "Linkedin",
    "role": "Rotational Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 18,
    "website": "https://careers.linkedin.com/apm",
    "comments": "",
    "description": "The LinkedIn Associate Product Manager program is a small, selective program that develops entry-level talent into world-class product managers. From Day 1, LinkedIn APMs take ownership of large and impactful projects, while still receiving mentorship and guidance from some of the best product leaders and entrepreneurs in the industry.",
    "prestige": 1
  },
  {
    "company": "LinkedIn",
    "role": "Strategy & Analytics Associate",
    "type": "Strategy",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://careers.linkedin.com/students/strategy-and-analytics",
    "comments": "",
    "description": "LinkedIn's Strategy & Analytics Program is a two-year rotational program designed as a career accelerator that prepares new college graduates to become exceptional business leaders. In high-visibility roles, S&A analysts master business skills like strategic framing, SQL & Presto, financial modeling, data visualization, and performance management. The S&A program also provides learning & development workshops and both executive and peer mentoring.",
    "prestige": 1
  },
  {
    "company": "Lyft",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 18,
    "website": "https://www.lyft.com/careers/apm",
    "comments": "",
    "description": "The Associate Product Manager (APM) program is an 18-month rotational program designed to accelerate the careers of exceptional new product managers. Our mission is to build Lyft's next generation of product leaders. We're looking for a small group of mission-driven people, excited to have huge impact in building the world's best transportation.",
    "prestige": 1
  },
  {
    "company": "Palantir",
    "role": "Deployment Strategist",
    "type": "PM",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.palantir.com/careers/teams/deployment-strategists",
    "comments": "",
    "description": "As Deployment Strategists, we combine a passion for technology with an ability to navigate organizational hurdles. We instinctively gravitate toward project ownership and team leadership. We present a comprehensive, compelling vision for how our software can transform the way our customers use data, then we test that vision through experimentation, iteration, and execution. Working side by side with our Forward Deployed Engineers, we find our way to solutions: through messy data, through bureaucratic labyrinths, through sandstorms in “data centers” made of tents and suitcases. Whatever it takes, we figure out how to do it.",
    "prestige": 1
  },
  {
    "company": "Schmidt Futures",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 24,
    "website": "https://schmidtfutures.com/our-work/talent/associate-product-manager/apm-program/",
    "comments": "",
    "description": "The Schmidt Futures APM program is modeled after a program first developed at Google as a way to give new computer science graduates unusual freedom and leeway in creating high impact projects. APMs will receive personalized leadership training, deepen their technical skills, participate in APM class trips around the world, regularly meet in small groups with CEOs and world leaders, and be mentored by a network of distinguished figures in technology, including Eric Schmidt, former CEO of Google and Executive Chairman of Alphabet.",
    "prestige": 1
  },
  {
    "company": "Twitter",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://www.twitterapm.com/#faqs-1",
    "comments": "",
    "description": "The mission of Twitter’s rotational Associate Product Manager program is to develop the next generation of product leaders. Through training, mentorship, and rotating assignments within various product teams at Twitter, APMs gain a unique view into how we design products and bring them to market.",
    "prestige": 1
  },
  {
    "company": "Uber",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 18,
    "website": "https://www.uberapms.com",
    "comments": "",
    "description": "Uber embraces a learn-by-doing philosophy- APMs start shipping high-impact products the moment they join Uber. Additionally, three six-month rotations allow APMs to get a breadth of skills across different parts of the business. APMs are given the tools to succeed professionally–senior product leaders mentor APMs in both project-specific work and career direction. APMs level each other up through continuous collaboration, and form friendships for life.",
    "prestige": 1
  },
  {
    "company": "Yelp",
    "role": "Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.yelp.com/careers/teams/college-engineering",
    "comments": "",
    "description": "At Yelp we’re passionate about our mission of connecting people with great local businesses. We are bringing together world-class talent from different areas of study to create a delightful product experience. We are looking for those completing their MBA program and are ready to enter into the program post-graduation. You should be a technical major with experience building software.",
    "prestige": 1
  },
  {
    "company": "APT",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.predictivetechnologies.com/en/team/product-management",
    "comments": "",
    "description": "Product Managers at APT are responsible for driving the overall product strategy.  That includes setting a vision and strategy, prioritizing features to develop, designing requirements, and evangelizing the product. To get all this done and drive tangible value for our Fortune 500 customers, Product Managers partner closely with Client Services, User Experience Designers, Engineering, Sales, and Marketing. Our Product Mangers have highly tuned analytic skills and a breadth of business knowledge that spans numerous verticals and functional areas, which they apply to each problem to ensure broad applicability.",
    "prestige": 0
  },
  {
    "company": "APT",
    "role": "Business Consultant",
    "type": "Consulting",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.predictivetechnologies.com/en/team/consulting",
    "comments": "",
    "description": "Business Consultants work on consulting projects across a wide range of industries. They play a substantial role by leading data-driven business analysis, drafting presentations, and developing relationships with our clients’ analysts. This requires outstanding analytical/quantitative skills, hard-working professionalism, and team work. You will work closely with Engagement Managers, Principals, and Vice Presidents and gain experience to take on larger responsibilities.",
    "prestige": 0
  },
  {
    "company": "Atlassian",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://www.atlassian.com/company/careers/graduates/apm",
    "comments": "",
    "description": "The Associate Product Manager (APM) program is designed to accelerate the growth of exceptionally creative problem solvers into the next generation of global leaders. Our APMs experience two, one-year long rotations with different Atlassian product teams.",
    "prestige": 0
  },
  {
    "company": "Capital One",
    "role": "Analyst Development Program Associate",
    "type": "Strategy",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://campus.capitalone.com/analytics-program?full-time",
    "comments": "",
    "description": "The Analyst Development Program (ADP) is a 2-year program designed for new grads hired at Capital One as Business Analysts and Data Analysts. It's our launch pad for new associates, giving them a well-rounded set of job-specific skills in two distinct roles through hands-on learning, ongoing education, and strategic placement in amazing roles.",
    "prestige": 0
  },
  {
    "company": "Capital One",
    "role": "Finance Rotation Program Associate",
    "type": "Finance",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://campus.capitalone.com/finance-program?id=full-time",
    "comments": "",
    "description": "The Finance Rotation Program (FRP) is a 2-year rotation program to help transition recent college grads into the professional world. FRP associates have the opportunity to experience two separate roles in Finance, providing them with a unique strategic perspective, a wide network, and a chance to explore where they best fit at Capital One. Potential areas to rotate through include Capital Markets & Analytics, Financial Planning & Analysis for a Line of Business, Enterprise Service, or Staff Group, and Controller’s Group.",
    "prestige": 0
  },
  {
    "company": "Capital One",
    "role": "Management Rotation Program Associate",
    "type": "Management",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://campus.capitalone.com/management-program?id=full-time",
    "comments": "",
    "description": "Capital One’s two-year Management Rotational Program (MRP) prepares associates to deliver complex, cross-functional initiatives that drive the business forward. MRP Associates use leadership skills and passion for problem solving to ensure our projects, systems, and processes deliver value to the organization. The MRP creates a pipeline for associate level talent into process, project, risk, audit, supplier management, brand and agile roles with a focus on attracting, retaining, and developing future leaders at Capital One.",
    "prestige": 0
  },
  {
    "company": "Capital One",
    "role": "Product Development Program Associate",
    "type": "PM",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://campus.capitalone.com/product-program?id=full-time",
    "comments": "",
    "description": "Our Product Development Program (PDP) equips recent grads with the skills to understand how we can best improve the experiences of our customers by driving innovation at every turn. PDPs will gain hands-on experience through 2 distinct product management roles where they will use business strategy and innovative tech solutions to meet customers needs and positively impact their lives. Working with experts across the enterprise, our PDPs help influence critical decision making at all levels. If tackling complex problems with a team of creative, curious people is where your passion lies, kick start your career in Product Management at Capital One!",
    "prestige": 0
  },
  {
    "company": "Capital One",
    "role": "Strategy Associate",
    "type": "Strategy",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://campus.capitalone.com/strategy-program/",
    "comments": "",
    "description": "The Strategy group is a small team of internal consultants who work on some of Capital One’s most strategically important decisions. As an Associate, you’ll support the Company’s relentless pursuit of strategic growth and innovation, all while developing world-class consulting skills. You’ll craft rigorous recommendations — through both qualitative and quantitative approaches — that will directly shape the thinking of company leadership. If you’re excited to solve tough problems with a team of creative, curious, and passionate people, the Strategy team may be the right fit for you.",
    "prestige": 0
  },
  {
    "company": "Cisco",
    "role": "Leaders in Finance and Technology (LIFT) Associate",
    "type": "Finance",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://www.cisco.com/c/en/us/about/careers/working-at-cisco/students-and-new-graduate-programs/finance-university-program.html",
    "comments": "",
    "description": "Cisco's Leaders in Finance & Technology program is not your typical two-year finance rotation program. LIFT goes beyond the normal post-college program and raises the bar. Our participants will learn to think like a CFO and become the next generation of business leaders! Are you eager to continue learning? Do you have a passion for leadership and technology? Do you want to make a difference in the world? If so, read on!",
    "prestige": 0
  },
  {
    "company": "Cisco",
    "role": "Marketing and Communications Program Associate",
    "type": "Marketing",
    "technical": 0,
    "rotational": "",
    "length_months": "",
    "website": "https://www.cisco.com/c/en/us/about/careers/working-at-cisco/students-and-new-graduate-programs/marketing-university-program.html",
    "comments": "",
    "description": "The Marketing and Communications program is made up of our internship, co-op, and undergraduate new hire (Amplify: Accelerated Marketing Program) participants. We are a global program with opportunities in the US, Europe, and Asia. The focus of the program is to develop talent across the entire Marketing and Communications organization. Participants learn how to think digitally and become the next generation of tech marketers.",
    "prestige": 0
  },
  {
    "company": "Cisco",
    "role": "Services University Program Associate",
    "type": "Sales",
    "technical": 0,
    "rotational": "",
    "length_months": "",
    "website": "https://www.cisco.com/c/en/us/about/careers/working-at-cisco/students-and-new-graduate-programs/services-university-program.html",
    "comments": "",
    "description": "Our world-class Services Academy development programs are available to apprentices, interns, co-ops, and new-graduate professionals. Our instructor-led and self-paced training helps you earn industry certifications, gain exposure to the world’s leading industry experts, and learn by doing. As part of Cisco Services, you will be able to provide expert assistance to design, build, manage, secure, optimize, and support our customer’s network.",
    "prestige": 0
  },
  {
    "company": "Cisco",
    "role": "Supply Chain Operations Associate",
    "type": "Supply Chain",
    "technical": 0,
    "rotational": "",
    "length_months": "",
    "website": "https://www.cisco.com/c/en/us/about/careers/working-at-cisco/students-and-new-graduate-programs/supply-chain-university-program.html",
    "comments": "",
    "description": "Cisco's Supply Chain Operations University Program is responsible for accelerating innovation, enabling profitable growth, and delivering an unrivaled customer experience. Our interns, co-ops, and new graduates work on real projects that have a measurable impact on the business. We know that education does not stop when you leave school. That's why we embrace a culture of continuous learning. Our training classes, rotation program, mentors, and community will help you achieve your maximum potential — whatever that might be.",
    "prestige": 0
  },
  {
    "company": "Education First",
    "role": "Global Finance Trainee",
    "type": "Finance",
    "technical": 0,
    "rotational": 1,
    "length_months": 12,
    "website": "https://careers.ef.com/categories/recent-graduates-and-internships/global-finance-program/",
    "comments": "",
    "description": "The EF Global Finance Program jump-starts your international career. Each year, we accept a handful of exceptionally talented individuals for this rotational program. Tailored for maximum exposure across financial sectors and EF’s senior management, this program places you in distinct and challenging roles across many products and financial functions. EF’s global reach, entrepreneurial culture and constant rate of strong business growth foster a special environment that opens up unparalleled international career paths for young professionals.",
    "prestige": 0
  },
  {
    "company": "Education First",
    "role": "Global Management Trainee",
    "type": "Management",
    "technical": 0,
    "rotational": 1,
    "length_months": 12,
    "website": "https://careers.ef.com/categories/recent-graduates-and-internships/360/",
    "comments": "",
    "description": "Fast track your career in one year with our 12 month leadership-training program. You will travel, learn the products and train under the mentorship of an EF division president.",
    "prestige": 0
  },
  {
    "company": "Education First",
    "role": "Global Technology Trainee",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 12,
    "website": "https://careers.ef.com/categories/recent-graduates-and-internships/360tech/",
    "comments": "",
    "description": "Architect your career in Technology. If you’re passionate about technology and innovation and are looking to get hands-on, professional experience in product, mobile & web development, collaborative software and integrated design; this 12 month program could be for you!",
    "prestige": 0
  },
  {
    "company": "HubSpot",
    "role": "Leadership Rotational Program Associate",
    "type": "Marketing",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://www.hubspot.com/jobs/students/recent-graduates/leadership-program",
    "comments": "",
    "description": "The HubSpot Leadership Rotational Program is a two-year program for graduating seniors and an accelerated path toward marketing leadership. This full-time position rotates through three different roles, each eight months in duration, starting in Technical Support followed by two rotations in Marketing. Unlike many other rotational programs, HubSpot creates a unique path for each participant based off of his or her interests and goals. In addition, all leadership participants have the opportunity to work in one of HubSpot’s international offices. HubSpot has locations in Dublin, Sydney, Singapore, and a growing team in Tokyo",
    "prestige": 0
  },
  {
    "company": "IBM",
    "role": "Associate Offering Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://careers.ibm.com/ShowJob/Id/717378/Associate-Offering-Manager-Program/?lang=en",
    "comments": "",
    "description": "IBM is transforming product management and has created a new discipline called IBM Offering Management. IBM Offering Management transforms how we take offerings to market by first focusing on the needs of the client. The Associate Offering Manager (AOM) Program is the cornerstone of this transformation. The AOM Program recruits and develops early-career, technically-minded entrepreneurs to join offering teams who are solving complex problems in a changing world. Our AOMs operate in a demanding role at the center of multidisciplinary teams which include design, engineering, sales, marketing, finance and legal. Our clients rank among the world's largest, most influential companies and governments, and our offering teams serve their needs under constantly changing priorities. We are passionate about using technology to solve these problems.",
    "prestige": 0
  },
  {
    "company": "Indeed",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": 1,
    "length_months": 30,
    "website": "https://university.indeed.jobs/tech/associate-product-management-apm-rotation-program/",
    "comments": "",
    "description": "Indeed’s APM Rotation Program transforms aspiring product managers into the leaders who will build the future of the hiring industry, and beyond. As an APM, you’ll spend your first three months in our onboarding program for recent Indeed University grads. There, you’ll prototype, build and pitch new product ideas. Next, you’ll be immersed in product onboarding week, gaining exposure to our product philosophy and all areas of our business. Then you’ll spend one year in Austin, Texas during your First Product Rotation. After that, you’ll embark on a Global Market Discovery Trip to markets around the world with your cohort, and take part in Micro Rotations focused on cross-functional partnerships. You’ll lead a high-profile product during your Second Product Rotation, either in Austin or another global tech office.",
    "prestige": 0
  },
  {
    "company": "Mastercard",
    "role": "Mastercard Launch Associate",
    "type": "Mixed",
    "technical": 0,
    "rotational": 1,
    "length_months": 18,
    "website": "https://www.mastercard.us/en-us/about-mastercard/careers/internships-college-hires.html",
    "comments": "",
    "description": "Mastercard Launch is an 18-month global development program providing recent graduates with development opportunities and exposure. You will not only enhance your professional growth and skills, you’ll launch your Mastercard career.",
    "prestige": 0
  },
  {
    "company": "Salesforce",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 24,
    "website": "https://www.salesforce.com/company/careers/university-recruiting/product/product-apm/",
    "comments": "",
    "description": "Our Associate Product Manager program is a 2 year rotational experience that helps kickstart your PM career with direct ownership of products, regular exposure to senior executives, fun events with fellow APMs and more.",
    "prestige": 0
  },
  {
    "company": "Salesforce",
    "role": "Customer Success Graduate",
    "type": "Consulting",
    "technical": 0,
    "rotational": 1,
    "length_months": 6,
    "website": "https://www.salesforce.com/company/careers/university-recruiting/customer-success/success-grad-csg/",
    "comments": "",
    "description": "Are you a recent graduate with a passion for sales and technology and a hunger for continuous learning? Solution engineers at Salesforce meet with potential customers to understand their business and goals and then they offer exciting technical solutions to that customer. A solution engineer often acts as a translator, taking complex challenges and offering solutions that are easy for anyone to understand! You’ll make contributions to our customers through direct engagements, carry your own responsibilities as a member of your functional team, and engage cross-functionally to drive breadth of competencies or explore other functions.",
    "prestige": 0
  },
  {
    "company": "Salesforce",
    "role": "Solution Engineer",
    "type": "Sales",
    "technical": 0,
    "rotational": 1,
    "length_months": 6,
    "website": "https://www.salesforce.com/company/careers/university-recruiting/sales/success-grad-solution-eng/",
    "comments": "",
    "description": "Our Success Graduate, Solution Engineer roles offer grads the inside track to a growing career field at the intersection of both Sales and Technology—Solutions organization. this program aims to enable our future workforce through career development, continuous learning, philanthropy and of course, the support of our Salesforce Ohana. Participants are deployed to their permanent Salesforce hubs across the U.S. where they practice their newly developed skills in the field working 1-on-1 with their teams, supporting the sales organization and learning to work with customers, partners and prospects.",
    "prestige": 0
  },
  {
    "company": "Salesforce",
    "role": "Business Development Associate",
    "type": "Sales",
    "technical": 0,
    "rotational": 1,
    "length_months": "",
    "website": "https://www.salesforce.com/company/careers/university-recruiting/sales/",
    "comments": "",
    "description": "Sales Development is the foundation of our sales organization where new business opportunities come to life. Within the Business Development Associate (BDA) role, we support outbound sales teams by assisting them through strategic prospecting efforts and extensive account research. BDAs consistently make a tangible impact in the Sales Development Organization by generating millions of dollars of new business pipeline each year. Additionally, BDAs are enrolled in an intensive sales training program that has been built specifically for the benefit of current university students and recent graduates. The purpose of our program is to provide new professionals with the fundamental skills necessary to achieve a successful sales career at Salesforce.",
    "prestige": 0
  },
  {
    "company": "Salesforce",
    "role": "Associate Product Marketing Manager",
    "type": "Marketing",
    "technical": 0,
    "rotational": 0,
    "length_months": 0,
    "website": "https://www.salesforce.com/company/careers/university-recruiting/marketing/",
    "comments": "",
    "description": "At Salesforce, our world class Product Marketers create and tell inspirational stories with cutting edge demonstrations to people around the world. We develop product messaging and positioning, go to market programs, campaigns, events, and sales enablement. We measure our success by our ability to develop creative and innovative marketing strategies and ability to gain C-level, IT Director and key buyers’ mindshare. Our Product Marketers are driving the go-to-market for their product teams with unique, differentiated messaging delivered across a range of marketing tactics. With dozens of products to choose from, each PMM has the opportunity to cultivate their career within a specialized space, while working directly with leadership, presenting in front of internal stakeholders, collaborating with our product leaders and engineers, and training our sales teams. Product Marketing Manager is the title for MBA students and Associate Product Marketing Manager is the title for undergraduate students.",
    "prestige": 0
  },
  {
    "company": "Verizon Media",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": 24,
    "website": "https://yahooapms.com",
    "comments": "",
    "description": "We’re looking for aspiring product managers to help us build the future of media and technology. As a continuation of the historic Yahoo APM program, Verizon Media continues to offers Yahoo APMs an even larger product portfolio and opportunities for impact.",
    "prestige": 0
  },
  {
    "company": "Visa",
    "role": "New Graduate Development Program Associate",
    "type": "Mixed",
    "technical": 0,
    "rotational": 1,
    "length_months": 24,
    "website": "https://usa.visa.com/careers.html",
    "comments": "Search for \"New Graduate Development Program (Undergraduate) - Business Associate\".",
    "description": "The New Graduate Development Rotation Program (NGDP) is a two year program with four - six month rotations through Visa’s functions. The NGDP program supports Visa’s mission to build a strong entry level pipeline of talent with cross-functional knowledge and experience. Associates rotate through various parts of the business, including but not limited to: Digital Solutions, Marketing, Processing, Product, Sales and Strategy. In addition to meaningful rotations, Associates are given training & development, mentoring, networking and leadership exposure.",
    "prestige": 0
  },
  {
    "company": "Walmart",
    "role": "Rotational Associate Product Manager",
    "type": "PM",
    "technical": 1,
    "rotational": 1,
    "length_months": "",
    "website": "https://careers.walmart.com/results?q=rotational%20associate%20product%20manager&page=1&sort=rank&jobCategory=00000161-8bda-d3dd-a1fd-bbda62130000&expand=department,brand,type,rate&type=jobs",
    "comments": "",
    "description": "Does the idea of improving the lives of millions of families by innovating at the nexus of ecommerce and physical retail excite you? Do you want to learn the craft of Product Management while gaining a deep understanding of end to end ecommerce? Becoming an Associate Product Manager at Walmart eCommerce puts you center stage at this pivotal moment in shopping and gives you the skills and understanding to be a top tier Product Manager in the Fortune #1 company in America.",
    "prestige": 0
  },
  {
    "company": "WeWork",
    "role": "Associate Product Manager",
    "type": "PM",
    "technical": 0,
    "rotational": "",
    "length_months": "",
    "website": "https://careers.wework.com/search-results?keywords=associate%20product%20manager",
    "comments": "",
    "description": "This role is for Flatiron School, a tech bootcamp owned by WeWork. Associate Product Managers will have a hand in all aspects of product development at Flatiron School. We are building and integrating an ecosystem of products to enable the School to operate and deliver student outcomes at scale. To succeed in this role, you will partner with almost every team in the company (including education, sales, marketing, and career services) to bring our courses to life and deliver a best in class experience for students, teachers and staff.",
    "prestige": 0
  },
  {
    "company": "Workday",
    "role": "Generation Workday Associate",
    "type": "Mixed",
    "technical": 0,
    "rotational": 1,
    "length_months": 12,
    "website": "https://www.workday.com/en-us/company/careers/university-recruiting.html",
    "comments": "",
    "description": "Generation Workday is an early-career development program designed to help new college grads make a successful transition from school to the workplace and accelerate their careers at Workday. Those hired as part of GW get exposure to multiple teams and projects that include networking events, career development boot camps, discussions with company leaders, and potentially even overseas job assignments. Rotations include Technology (Engineering), Services (Consulting), and Product Management.",
    "prestige": 0
  }
]
